docs/GSBFrais/app/Models/GsbModel.php

    public function get_les_infos_ficheFrais($idFiche)
    {
        return $this->db->table('fichefrais')
            ->select('fichefrais.idFiche, fichefrais.idEtat, fichefrais.dateModif, fichefrais.nbJustificatifs, fichefrais.montantValide, etatfrais.libelle')
            ->join('etatfrais', 'fichefrais.idEtat = etatfrais.idetat')
            ->where('fichefrais.idFiche', $idFiche)
            ->get()
            ->getRowArray();
---
SELECT `fichefrais`.`idFiche`, `fichefrais`.`idEtat`, `fichefrais`.`dateModif`, `fichefrais`.`nbJustificatifs`, `fichefrais`.`montantValide`, `etatfrais`.`libelle`
FROM `fichefrais`
JOIN `etatfrais` ON `fichefrais`.`idEtat` = `etatfrais`.`idetat`
WHERE `fichefrais`.`idFiche` = '942'

    public function get_les_frais_forfait($idFiche)
    {
        return $this->db->table('lignefraisforfait')
            ->select('fraisforfait.idfraisforfait, fraisforfait.libelle, lignefraisforfait.quantite')
            ->join('fraisforfait', 'fraisforfait.idfraisforfait = lignefraisforfait.idFraisForfait')
            ->where('lignefraisforfait.idFiche', $idFiche)
            ->orderBy('lignefraisforfait.idFraisForfait', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `fraisforfait`.`idfraisforfait`, `fraisforfait`.`libelle`, `lignefraisforfait`.`quantite`
FROM `lignefraisforfait`
JOIN `fraisforfait` ON `fraisforfait`.`idfraisforfait` = `lignefraisforfait`.`idFraisForfait`
WHERE `lignefraisforfait`.`idFiche` = '942'
ORDER BY `lignefraisforfait`.`idFraisForfait` ASC

    public function get_les_frais_hors_forfait($idFiche)
    {
        return $this->db->table('lignefraishorsforfait')
            ->where('idFiche', $idFiche)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `lignefraishorsforfait`
WHERE `idFiche` = '942'

    public function maj_frais_forfait($idFiche, array $lesFrais)
    {
        $majOK = true;
        foreach (array_keys($lesFrais) as $idFrais) {
            $res = $this->db->table('lignefraisforfait')->update(
                ['quantite' => $lesFrais[$idFrais]],
                ['idFiche' => $idFiche, 'idFraisForfait' => $idFrais]
            );
---
UPDATE `lignefraisforfait` SET `quantite` = '14'
WHERE `idFiche` = '886'
AND `idFraisForfait` = 'ETP'

    public function get_fiches_en_attente_validation()
    {
        return $this->db->table('fichefrais f')
            ->select('f.idFiche, f.annee, f.mois, u.nom, u.prenom')
            ->join('utilisateur u', 'u.idUtilisateur = f.idUtilisateur')
            ->where('f.idEtat', 'CL')
            ->orderBy('u.nom')
            ->orderBy('f.annee', 'DESC')
            ->orderBy('f.mois', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `f`.`idFiche`, `f`.`annee`, `f`.`mois`, `u`.`nom`, `u`.`prenom`
FROM `fichefrais` `f`
JOIN `utilisateur` `u` ON `u`.`idUtilisateur` = `f`.`idUtilisateur`
WHERE `f`.`idEtat` = 'CL'
ORDER BY `u`.`nom`, `f`.`annee` DESC, `f`.`mois` DESC

    public function get_un_frais_hors_forfait($idFraisHF)
    {
        return $this->db->table('lignefraishorsforfait')
            ->where('idLigneFHF', $idFraisHF)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `lignefraishorsforfait`
WHERE `idLigneFHF` = '3249'

    public function maj_libelle_frais_hors_forfait($idFraisHF, $nouveauLibelle)
    {
        return $this->db->table('lignefraishorsforfait')
            ->where('idLigneFHF', $idFraisHF)
            ->update(['libelle' => $nouveauLibelle]);
---
UPDATE `lignefraishorsforfait` SET `libelle` = 'REFUSE:traiteur, alimentation, boisson'
WHERE `idLigneFHF` = '3249'

    public function maj_montant_valide($idFiche)
    {
        $forfaits = $this->db->table('lignefraisforfait lff')
            ->select('SUM(lff.quantite * ff.montant) AS total')
            ->join('fraisforfait ff', 'ff.idfraisforfait = lff.idFraisForfait')
            ->where('lff.idFiche', $idFiche)
            ->get()
            ->getRowArray();

        $horsForfait = $this->db->table('lignefraishorsforfait')
            ->select('SUM(montant) AS total')
            ->where('idFiche', $idFiche)
            ->where('libelle NOT LIKE', 'REFUSE:%')
            ->where('libelle NOT LIKE', 'REPORT:%') // ← ajouté
            ->get()
            ->getRowArray();

        $montantTotal = ($forfaits['total'] ?? 0) + ($horsForfait['total'] ?? 0);

        return $this->db->table('fichefrais')
            ->where('idFiche', $idFiche)
            ->update(['montantValide' => $montantTotal]);
---
SELECT SUM(lff.quantite * ff.montant) AS total
FROM `lignefraisforfait` `lff`
JOIN `fraisforfait` `ff` ON `ff`.`idfraisforfait` = `lff`.`idFraisForfait`
WHERE `lff`.`idFiche` = '942'
SELECT SUM(montant) AS total
FROM `lignefraishorsforfait`
WHERE `idFiche` = '942'
AND `libelle` NOT LIKE 'REFUSE:%'
AND `libelle` NOT LIKE 'REPORT:%'
SELECT SUM(montant) AS total
FROM `lignefraishorsforfait`
WHERE `idFiche` = '886'
AND `libelle` NOT LIKE 'REFUSE:%'
UPDATE `fichefrais` SET `montantValide` = 3124.68
WHERE `idFiche` = '942'